In [13]:
import pandas as pd

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [10, 52, 36, 24, 73]}
df = pd.DataFrame(data, columns = ['name', 'age'])
df

    name  age
0  Jason   10
1  Molly   52
2   Tina   36
3   Jake   24
4    Amy   73

In [14]:
elderly = df.age.case_when([
    (df.age.lt(10),                 'baby'),
    (df.age.ge(10) & df.age.lt(20), 'kid'),
    (df.age.ge(20) & df.age.lt(30), 'young'),
    (df.age.ge(30) & df.age.lt(50), 'mature'),
    (df.age.ge(50),                 'grandpa'),
])
elderly

0        kid
1    grandpa
2     mature
3      young
4    grandpa
Name: age, dtype: object

In [15]:
df1 = df.assign(elderly=elderly)

In [16]:
df1

    name  age  elderly
0  Jason   10      kid
1  Molly   52  grandpa
2   Tina   36   mature
3   Jake   24    young
4    Amy   73  grandpa